artifacts/oscar_e2e/fig4_groups_sweep_qwen3_8b/bf16/in100000_bs32_g8/bench_serving.log
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=32201, ready_check_timeout_sec=60, dataset_name='generated-shared-prefix', dataset_path='', model=None, served_model_name=None, tokenizer=None, num_prompts=32, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=32, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=8, gsp_prompts_per_group=4, gsp_system_prompt_len=100000, gsp_question_len=128, gsp_output_len=1000, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)
Waiting up to 60s for http://127.0.0.1:32201/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=32201, ready_check_timeout_sec=60, dataset_name='generated-shared-prefix', dataset_path='', model='Qwen/Qwen3-8B', served_model_name=None, tokenizer=None, num_prompts=32, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=32, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=8, gsp_prompts_per_group=4, gsp_system_prompt_len=100000, gsp_question_len=128, gsp_output_len=1000, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)


Loading cached generated input data from /root/.cache/sglang/benchmark/gen_shared_prefix_1_8_4_100000_128_1000_Qwen2Tokenizer.pkl
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 32        
Successful requests:                     32        
Benchmark duration (s):                  934.18    
Total input tokens:                      3373522   
Total input text tokens:                 3373522   
Total generated tokens:                  32000     
Total generated tokens (retokenized):    19236     
Request throughput (req/s):              0.03      
Input token throughput (tok/s):          3611.23   
Output token throughput (tok/s):         34.25     
Peak output token throughput (tok/s):    138.00    
Peak concurrent requests:                32        
Total token throughput (tok/s):          3645.48   
Concurrency:                             16.42     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   479364.91 
Median E2E Latency (ms):                 466538.47 
P90 E2E Latency (ms):                    810046.89 
P99 E2E Latency (ms):                    915904.48 
---------------Time to First Token----------------
Mean TTFT (ms):                          425294.11 
Median TTFT (ms):                        413098.90 
P99 TTFT (ms):                           865526.74 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          54.12     
Median TPOT (ms):                        56.57     
P99 TPOT (ms):                           57.81     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           54.12     
Median ITL (ms):                         49.46     
P95 ITL (ms):                            50.21     
P99 ITL (ms):                            50.93     
Max ITL (ms):                            8809.66   
==================================================
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.

  0%|          | 0/32 [00:00<?, ?it/s]
  3%|▎         | 1/32 [00:57<29:57, 57.98s/it]
  6%|▋         | 2/32 [01:07<14:37, 29.26s/it]
  9%|▉         | 3/32 [02:03<20:06, 41.60s/it]
 16%|█▌        | 5/32 [02:11<09:10, 20.38s/it]
 19%|█▉        | 6/32 [03:08<13:24, 30.93s/it]
 22%|██▏       | 7/32 [03:16<10:08, 24.33s/it]
 25%|██▌       | 8/32 [04:14<13:34, 33.95s/it]
 28%|██▊       | 9/32 [04:22<10:06, 26.35s/it]
 31%|███▏      | 10/32 [05:15<12:32, 34.20s/it]
 34%|███▍      | 11/32 [05:18<08:48, 25.17s/it]
 38%|███▊      | 12/32 [06:16<11:36, 34.82s/it]
 41%|████      | 13/32 [06:24<08:30, 26.88s/it]
 47%|████▋     | 15/32 [07:13<07:19, 25.84s/it]
 53%|█████▎    | 17/32 [08:19<07:08, 28.53s/it]
 59%|█████▉    | 19/32 [09:20<06:21, 29.38s/it]
 66%|██████▌   | 21/32 [10:26<05:35, 30.50s/it]
 72%|███████▏  | 23/32 [11:27<04:34, 30.52s/it]
 78%|███████▊  | 25/32 [12:24<03:29, 29.96s/it]
 88%|████████▊ | 28/32 [13:30<01:46, 26.62s/it]
 94%|█████████▍| 30/32 [14:35<00:56, 28.32s/it]
100%|██████████| 32/32 [15:34<00:00, 28.60s/it]
100%|██████████| 32/32 [15:34<00:00, 29.19s/it]